app/Controllers/Home.php

SELECT *
FROM `umkmdata`
SELECT COUNT(*) AS `numrows` FROM `umkmdata`
SELECT COUNT(*) AS `numrows`
FROM `umkmdata`
WHERE `kategori` = 'makanan'
SELECT COUNT(*) AS `numrows`
FROM `umkmdata`
WHERE `kategori` = 'non makanan'
SELECT COUNT(id) AS jumlah, `kecamatan`
FROM `umkmdata`
GROUP BY `kecamatan`
SELECT SUM(CASE WHEN kategori = "makanan" THEN 1 ELSE 0 END) AS jumlah_makanan, SUM(CASE WHEN kategori = "non makanan" THEN 1 ELSE 0 END) AS jumlah_non_makanan
FROM `umkmdata`
---
    public function index()
    {
        $umkmdata = $this->umkmdataModel->findAll();
        $jumlah_baris = $this->umkmdataModel->countAll(); // Menghitung jumlah baris pada tabel

        // Menghitung jumlah kolom kategori berisi 'makanan'
        $jumlah_makanan = $this->umkmdataModel->where('kategori', 'makanan')->countAllResults();
        $jumlah_non_makanan = $this->umkmdataModel->where('kategori', 'non makanan')->countAllResults();
        $jumlah_per_kecamatan = $this->umkmdataModel->select('COUNT(id) AS jumlah, kecamatan')
            ->groupBy('kecamatan')
            ->findAll();

        $jumlah_makanan_nonmakanan = $this->umkmdataModel->
            select('SUM(CASE WHEN kategori = "makanan" THEN 1 ELSE 0 END) AS jumlah_makanan,
                    SUM(CASE WHEN kategori = "non makanan" THEN 1 ELSE 0 END) AS jumlah_non_makanan')
            ->find();