app/Controllers/Job.php

SELECT *
FROM `umkmdata`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `umkmdata`
SELECT *
FROM `umkmdata`
 LIMIT 10
---
    public function index()
    {
        //$job = $this->umkmdataModel->findAll();
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $umkm = $this->umkmdataModel->search($keyword);
        } else {
            $umkm = $this->umkmdataModel;
        }

        $data = [
            'tittle' => "Job List | E-Rekrutmen",
            'umkmdata' => $umkm->paginate(10, 'umkmdata'),
            'pager' => $this->umkmdataModel->pager
        ];

SELECT *
FROM `umkmdata`
---
    public function viewpdf()
    {
        $umkm = $this->umkmdataModel->findAll();