app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'naufalfadhil8260@gmail.com'
 LIMIT 1
---
    public function create()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->userModel
            ->where('email', $email)
            ->first();