app/Controllers/Umkmdata.php

SELECT *
FROM `umkmdata`
 LIMIT 610, 10
SELECT COUNT(*) AS `numrows`
FROM `umkmdata`
---
    public function index()
    {
        $currentPage = $this->request->getVar('page_umkmdata') ? $this->request->getVar('page_umkmdata') :
            1;
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            session()->set('keyword', $keyword);
            $umkm = $this->umkmdataModel->search($keyword);
        } else {
            session()->remove('keyword');
            $umkm = $this->umkmdataModel;
        }

        $data = [
            'tittle' => "umkmdata List | SI-IDA",
            'umkmdata' => $umkm->paginate(10, 'umkmdata'),

UPDATE `umkmdata` SET `tanggal` = '2023-07-08T00:00', `nama` = 'HP', `fotoktp` = 'asa', `jns_kelamin` = NULL, `alamat` = 'asa', `kecamatan` = 'asa', `kelurahan` = 'asa', `kota` = 'asa', `kodepos` = '1111', `namausaha` = 'asa', `produk1` = 'asa', `produk2` = 'asa', `produk3` = 'asa', `produk4` = 'as', `kategori` = 'Makanan', `status_nib` = 'BELUM'
WHERE `umkmdata`.`id` IN ('617')
---
    public function update($id)
    {
        $data = [
            "tanggal" => $this->request->getPost('tanggal'),
            "nama" => $this->request->getPost('nama'),
            "fotoktp" => $this->request->getPost('fotoktp'),
            "jns_kelamin" => $this->request->getPost('jns_kelamin'),
            "alamat" => $this->request->getPost('alamat'),
            "kecamatan" => $this->request->getPost('kecamatan'),
            "kelurahan" => $this->request->getPost('kelurahan'),
            "kota" => $this->request->getPost('kota'),
            "kodepos" => $this->request->getPost('kodepos'),
            "namausaha" => $this->request->getPost('namausaha'),
            "produk1" => $this->request->getPost('produk1'),
            "produk2" => $this->request->getPost('produk2'),
            "produk3" => $this->request->getPost('produk3'),
            "produk4" => $this->request->getPost('produk4'),
            "kategori" => $this->request->getPost('kategori'),
            "status_nib" => $this->request->getPost('status_nib'),
        ];
        $this->umkmdataModel->update($id, $data);

DELETE FROM `umkmdata`
WHERE `id` IN ('615')
---
    public function delete($id)
    {
        $this->umkmdataModel->delete($id);