app/Models/UmkmDataModel.php

SELECT *
FROM `umkmdata`
WHERE `id` = '10'
 LIMIT 1
---
    public function getUmkmData($id = false)
    {
        if ($id == false) {
            return $this->findAll();
        }

        return $this->where(['id' => $id])->first();